blog/20231121-1858.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.p-snow.org/config/blog/rss.xml"
      title="RSS feed for https://www.p-snow.org/config/blog">
<title>Org内でタスク名のヒストリを残す</title>
<meta charset="utf-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1.0"><link rel="stylesheet" href="https://cdn.simplecss.org/simple.css"><link rel="stylesheet" href="./assets/css/style.css"></head>
<body>
<div id="preamble" class="status"><header><nav><a href="https://www.p-snow.org">Home</a><a href="https://www.p-snow.org/config/blog/tag-english.html">Posts</a><a href="https://www.p-snow.org/config/blog/tag-japanese.html">日本語記事</a><a href="https://www.p-snow.org/config/blog/about.html">About</a><a href="https://www.p-snow.org/config/blog/rss.xml">RSS</a></nav><h1>.dot life</h1><p>by p-snow</p></header></div>
<div id="content">
<div class="post-date">21 Nov 2023</div><h1 class="post-title"><a href="https://www.p-snow.org/config/blog/20231121-1858.html">Org内でタスク名のヒストリを残す</a></h1>
<p>
<preview>
タスクとは、生まれて実施されて終えられて捨てられる。そんな存在。たとえ賞味の実施期間は短くとも、タスクのライフサイクル全体を見れば、管理する当人も驚くくらいに長くなっていたなんてことはザラにあるのではないでしょうか。長い時間というものはいろいろなものを変え得る可能性を秘めています。ビジネスの風向きが変わることもあれば、生活環境が変わることもあるでしょう。そんな変化を経てもタスクだけは絶対に不変であるなんてことはもちろんありません。もしかしたらタスクの中身、つまりやることは不変だったとしても、タスク管理者のタスクに対するまなざしが変わっていたなんてこともあるでしょう。そんなときにおもうのです。「このタスク名、何か変じゃね」と。
</preview>
</p>

<p>
タスク名を変える。行為としてはこんな簡単なことはありません。でも私はこれが苦手でした。なぜでしょうか。ひとつには、改名するにあたり経年したタスクと真剣に向き合い直す必要があり、メンタル負荷的にこれを避けたいという心理がはたらいていたのかもしれません。もう一つは、改名することで前のタスク名が完全に消されてしまい、タスクの時間的な変遷が隠れてしまうことを惜しんでいたフシがあるような気がします。タスクを作成した当初はこういう意図や動機があってこう名付けたが、事情や事態が変わってああいうタスク名になった、というような情報は個人的には軽視できないメタ情報だとおもいます。タスク内にメモすればいいわけですが、改名のワークフローとフォーマットは統一されていた方が自分好みなので下のようなコードを書きました。新しいタスク名を入力するとタスクが改名されると同時に一つ前のタスク名は日付情報とともにヒストリとして保存されます。
</p>

<p>
<details><summary>Elisp Code</summary><p>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-log-into-drawer t)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/org-change-heading</span> ()
  <span style="font-style: italic;">"CHange the heading of the entry at `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">point</span><span style="font-style: italic;">'.</span>

<span style="font-style: italic;">The previous name will be stored along with the execution date."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">let*</span> ((old-heading (org-get-heading t t t t))
         (new-heading (read-string <span style="font-style: italic;">"Heading: "</span> old-heading)))
    (<span style="font-weight: bold;">save-excursion</span>
      (org-back-to-heading t)
      (replace-string old-heading new-heading nil
                      (line-beginning-position) (line-end-position))
      (org-align-tags))
    (org-add-log-setup 'state new-heading old-heading 'state)))
</pre>
</div>
<p>
</p></details>
</p>

<p>
この機能を使うようになってからタスクの作成と改名が軽快におこなえるようになった気がします。「会議で提案されたアレをやっておく」のようなタスクが作成できるようになって、後で修正すせばいいからとタスク作成の心理的な負荷が軽減される一方で、修正後に残されたヒストリを見て「発生時にはアレと呼ばなければならないくらい、このタスクはあの時点では自分にとって新規性の高いものだったんだな」などと振り返ることができるのです。
</p>
<div class="taglist"><a href="https://www.p-snow.org/config/blog/tags.html">Tags</a>: <a href="https://www.p-snow.org/config/blog/tag-org.html">org</a> <a href="https://www.p-snow.org/config/blog/tag-japanese.html">japanese</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
